class script(object):
    HELP_TXT = """<b>𝐇𝐞𝐲</b> {}
    
<b>𝐕𝐨𝐢𝐜𝐢 𝐥'𝐚𝐢𝐝𝐞 𝐩𝐨𝐮𝐫 𝐦𝐞𝐬 𝐜𝐨𝐦𝐦𝐚𝐧𝐝𝐞𝐬.</b>"""

    CAPTION_TXT = """<b><u>📝  ᴄᴏᴍᴍᴇɴᴛ ᴅéғɪɴɪʀ ᴜɴᴇ ʟéɢᴇɴᴅᴇ</u></b>

<b>⦿ /set_caption - Uᴛɪʟɪsᴇᴢ ᴄᴇᴛᴛᴇ ᴄᴏᴍᴍᴀɴᴅᴇ ᴘᴏᴜʀ ᴅéғɪɴɪʀ ᴠᴏᴛʀᴇ ʟéɢᴇɴᴅᴇ</b>
<b>⦿ /see_caption - Uᴛɪʟɪsᴇᴢ ᴄᴇᴛᴛᴇ ᴄᴏᴍᴍᴀɴᴅᴇ ᴘᴏᴜʀ ᴠᴏɪʀ ᴠᴏᴛʀᴇ ʟéɢᴇɴᴅᴇ</b>
<b>⦿ /del_caption - Uᴛɪʟɪsᴇᴢ ᴄᴇᴛᴛᴇ ᴄᴏᴍᴍᴀɴᴅᴇ ᴘᴏᴜʀ sᴜᴘᴘʀɪᴍᴇʀ ᴠᴏᴛʀᴇ ʟéɢᴇɴᴅᴇ</b>"""
   
    THUMBNAIL_TXT = """<b><u>🖼️ ᴄᴏᴍᴍᴇɴᴛ ᴅéғɪɴɪʀ ᴜɴᴇ ᴍɪɴɪᴀᴛᴜʀᴇ</u></b>

<b>⦿ Vᴏᴜs ᴘᴏᴜᴠᴇᴢ ᴀᴊᴏᴜᴛᴇʀ ᴜɴᴇ ᴍɪɴɪᴀᴛᴜʀᴇ ᴘᴇʀsᴏɴɴᴀʟɪséᴇ sɪᴍᴘʟᴇᴍᴇɴᴛ ᴇɴ ᴍ'ᴇɴᴠᴏʏᴀɴᴛ ᴜɴᴇ ᴘʜᴏᴛᴏ...</b>

<b>⦿ /viewthumb - Uᴛɪʟɪsᴇᴢ ᴄᴇᴛᴛᴇ ᴄᴏᴍᴍᴀɴᴅᴇ ᴘᴏᴜʀ ᴠᴏɪʀ ᴠᴏᴛʀᴇ ᴍɪɴɪᴀᴛᴜʀᴇ</b>
<b>⦿ /delthumb - Uᴛɪʟɪsᴇᴢ ᴄᴇᴛᴛᴇ ᴄᴏᴍᴍᴀɴᴅᴇ ᴘᴏᴜʀ sᴜᴘᴘʀɪᴍᴇʀ ᴠᴏᴛʀᴇ ᴍɪɴɪᴀᴛᴜʀᴇ</b>"""

    ABOUT_TXT = """<b>🤖 ᴍᴏɴ ɴᴏᴍ :</b> <a href='https://t.me/HokageRenamer_bot'>Rename Bot 2.0</a>
<b>📝 ʟᴀɴɢᴀɢᴇ :</b> <a href='https://python.org'>Python 3</a>
<b>📚 ʟɪʙʀᴀɪʀɪᴇ :</b> <a href='https://pyrogram.org'>Pyrogram 2.0</a>
<b>🚀 sᴇʀᴠᴇᴜʀ :</b> <a href='https://app.koyeb.com'>Koyeb</a>
<b>📢 ᴄᴀɴᴀʟ :</b> <a href='https://t.me/hyoshmangavf'>Tout Manga</a>
<b>🧑‍💻 ᴅéᴠᴇʟᴏᴘᴘᴇᴜʀ :</b> <a href='https://t.me/Hyoshdesign'>Hyoshdesign</a>

<b>♻️ ʙᴏᴛ ᴄʀéᴇ ᴘᴀʀ :</b> @hyoshdesign"""

    DONATE_TXT = """
<b>🥲 ᴍᴇʀᴄɪ ᴘᴏᴜʀ ᴠᴏᴛʀᴇ ɪɴᴛéʀêᴛ ᴘᴏᴜʀ ʟᴇs ᴅᴏɴs ! ❤️</b>

sɪ ᴠᴏᴜs ᴀɪᴍᴇᴢ ᴍᴇs ʙᴏᴛs ᴇᴛ ᴘʀᴏᴊᴇᴛs, ᴠᴏᴜs ᴘᴏᴜᴠᴇᴢ 🎁 ᴍᴇ ғᴀɪʀᴇ ᴜɴ ᴅᴏɴ ᴅ'ᴜɴ ᴍᴏɴᴛᴀɴᴛ ᴀʟʟᴀɴᴛ ᴅᴇ 10 $ ᴀ̀ ᴠᴏᴛʀᴇ ᴄʜᴏɪx.


<b>📸 ᴇɴᴠᴏʏᴇᴢ ᴜɴᴇ ᴄᴀᴘᴛᴜʀᴇ ᴅ'éᴄʀᴀɴ ᴀᴘʀès ᴠᴏᴛʀᴇ ᴅᴏɴ ᴘᴏᴜʀ ᴀᴄᴛɪᴠᴇʀ ᴠᴏᴛʀᴇ ᴘʟᴀɴ ᴘʀᴇᴍɪᴜᴍ</b> """

    ADMIN_TXT = """<b><u>🦋 ᴄᴏᴍᴍᴀɴᴅᴇs ᴀᴅᴍɪɴɪsᴛʀᴀᴛᴇᴜʀ</u></b>

<b>⦿ /users - Uᴛɪʟɪsᴇᴢ ᴄᴇᴛᴛᴇ ᴄᴏᴍᴍᴀɴᴅᴇ ᴘᴏᴜʀ ᴠᴏɪʀ ʟᴇ ɴᴏᴍʙʀᴇ ᴛᴏᴛᴀʟ ᴅ'ᴜᴛɪʟɪsᴀᴛᴇᴜʀs</b>
<b>⦿ /allids - Uᴛɪʟɪsᴇᴢ ᴄᴇᴛᴛᴇ ᴄᴏᴍᴍᴀɴᴅᴇ ᴘᴏᴜʀ ᴠᴏɪʀ ᴛᴏᴜs ʟᴇs IDs ᴅᴇs ᴜᴛɪʟɪsᴀᴛᴇᴜʀs</b>
<b>⦿ /broadcast - Uᴛɪʟɪsᴇᴢ ᴄᴇᴛᴛᴇ ᴄᴏᴍᴍᴀɴᴅᴇ ᴘᴏᴜʀ ᴇɴᴠᴏʏᴇʀ ᴜɴ ᴍᴇssᴀɢᴇ ᴀᴜx ᴜᴛɪʟɪsᴀᴛᴇᴜʀs</b>
<b>⦿ /warn - Uᴛɪʟɪsᴇᴢ ᴄᴇᴛᴛᴇ ᴄᴏᴍᴍᴀɴᴅᴇ ᴘᴏᴜʀ ᴇɴᴠᴏʏᴇʀ ᴜɴ ᴀᴠᴇʀᴛɪssᴇᴍᴇɴᴛ ᴀ̀ ᴜɴ ᴜᴛɪʟɪsᴀᴛᴇᴜʀ</b>
<b>⦿ /resetpower - Uᴛɪʟɪsᴇᴢ ᴄᴇᴛᴛᴇ ᴄᴏᴍᴍᴀɴᴅᴇ ᴘᴏᴜʀ ʀéɪɴɪᴛɪᴀʟɪsᴇʀ ʟᴇs ᴘʀɪᴠɪʟèɢᴇs ᴅ'ᴜɴ ᴜᴛɪʟɪsᴀᴛᴇᴜʀ</b>
<b>⦿ /ceasepower - Uᴛɪʟɪsᴇᴢ ᴄᴇᴛᴛᴇ ᴄᴏᴍᴍᴀɴᴅᴇ ᴘᴏᴜʀ sᴜsᴘᴇɴᴅʀᴇ ʟᴇs ᴘʀɪᴠɪʟèɢᴇs ᴅ'ᴜɴ ᴜᴛɪʟɪsᴀᴛᴇᴜʀ</b>
<b>⦿ /addpremium - Uᴛɪʟɪsᴇᴢ ᴄᴇᴛᴛᴇ ᴄᴏᴍᴍᴀɴᴅᴇ ᴘᴏᴜʀ ᴀᴊᴏᴜᴛᴇʀ ᴜɴ ᴀʙᴏɴɴᴇᴍᴇɴᴛ ᴘʀᴇᴍɪᴜᴍ</b>
<b>⦿ /restart - Uᴛɪʟɪsᴇᴢ ᴄᴇᴛᴛᴇ ᴄᴏᴍᴍᴀɴᴅᴇ ᴘᴏᴜʀ ᴀɴɴᴜʟᴇʀ ᴛᴏᴜs ʟᴇs ᴘʀᴏᴄᴇssᴜs ᴇᴛ ʀᴇᴅéᴍᴀʀʀᴇʀ ʟᴇ ʙᴏᴛ</b>"""
